---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsSupporttypeMaterial
source: html/0af2d6c3-f645-c90f-41eb-708aff46e41f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsSupporttypeMaterial Property

"Material": Material

## Syntax (C#)
```csharp
public static ForgeTypeId StairsSupporttypeMaterial { get; }
```